app/views/articles/show.html.erb

 <tbody>
    <% @article.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 5