app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user_id=session[:user].to_i
    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('rails', 'ruby on rails', 1, '2018-08-11 14:38:11', '2018-08-11 14:38:11')