app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1
INSERT INTO `comments` (`body`, `article_id`, `created_at`, `updated_at`) VALUES ('sdasds', 5, '2018-08-12 00:31:46', '2018-08-12 00:31:46')
---
 def create

@article=Article.find(params[:article_id])
@comment=@article.comments.new(comment_params)
#@comment.user_id=session[:user].to_i
@comment.save