app/controllers/controls_controller.rb

   def login
  	 if request.post?
    user = User.find_by(:email=>params[:email], :password=>params[:password])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'yousef' AND `users`.`password` = 'aaaaa' LIMIT 1