app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`Email`, `password`, `created_at`, `updated_at`) VALUES ('yousef', 'okka', '2018-08-11 14:37:44', '2018-08-11 14:37:44')